[{"nome":"Hardware","itens":[{"descricao":"Compatibilidade com ambiente virtualizado VMWare VSphere (ESX) 4.1 ou superior","obrigatorio":true,"validacao":"Instalar e testar aplicativo em servidor 64 bits virtualizado"},{"descricao":"Compatibilizado com Plataforma Tecnológica Aberta INTEL/AMD","obrigatorio":true,"validacao":"Teste sobre qualquer Windows ou Linux 64 bits virtualizado(hosts de virtualização do BRB são Intel)"}]},{"nome":"Software Básico","itens":[{"descricao":"Windows Datacenter 2008","obrigatorio":false,"validacao":"Obrigatório caso a aplicação vá funcionar sobre Windows – Teste 1.1"},{"descricao":"Software para virtualização: VMWARE vSPHERE 4.1;","obrigatorio":true,"validacao":"Teste 1.1"},{"descricao":"Gerenciadores de Banco de Dados Oracle 11g sobre Oracle Unbreakable Linux 64 bits ou superior e SQL Server 2008 ou superior","obrigatorio":true,"validacao":"Criar BD sobre Oracle 11 Linux e testar aplicação\nCriar BD sobre MS SQL Server 2008 e testar aplicação"},{"descricao":"Ferramenta de Mensageria: Websphere Application Server e MQ Series 7.0 da IBM;","obrigatorio":false,"validacao":"Obrigatório caso a ferramenta utilize Mensageria e Servidor de Aplicações – Instalar e testar a aplicação sobre Websphere AS e MQ Series"},{"descricao":"Sistema de Backup baseado no padrão: CA-ArcServer 12.5;","obrigatorio":false,"validacao":"Apenas em casos específicos de software Básico. Ex: SGBDs e Hypervisors"},{"descricao":"Sistema de proteção anti-vírus: padrão McAfee versão 5;","obrigatorio":true,"validacao":"Instalar aplicação em servidor com o antivirus ativado"},{"descricao":"Sistema Operacional de Rede: 2003 Server ou superior.","obrigatorio":true,"validacao":"Validar Login de Rede"},{"descricao":"Sistema de Correio Eletrônico: MS-Exchange Server versão 2003 ou superior.","obrigatorio":false,"validacao":"Caso a aplicação possua tal funcionalidade. Enviar msg via aplicação"},{"descricao":"Sistema de Intranet/Internet: MS-Internet Information Server 6.0 ou superior.","obrigatorio":false,"validacao":"Obrigatório apenas para casos em que a aplicação não funcione sobre JBOSS ou outro"},{"descricao":"Sistema de proteção anti-vírus e anti-spam: padrão McAfee versão 4.0.0.1494;","obrigatorio":false,"validacao":"2.6???"}],"novo":{}},{"nome":"Software Básico Plataforma Software Livre","novo":{},"itens":[{"descricao":"Sistema Operacional Linux CentOS 5 e superior","obrigatorio":false,"validacao":"Caso seja software livre. Instalar a aplicação sobre Centos 5 e superior"},{"descricao":"Servidor de Aplicações Jboss/Tomcat","obrigatorio":false,"validacao":"Caso seja software livre. Instalar a aplicação sobre Jboss/Tomcat"},{"descricao":"Ferramenta ETL: Powercenter;","obrigatorio":false,"validacao":"Validar se existe conectores ETL para o SGBD da aplicação ou se é possível gerar arquivos plain text"},{"descricao":"Controle de Versões: Subversion 1.6 ou superior;","obrigatorio":false,"validacao":"Caso o BRB tenha acesso ao código fonte.????"}]},{"nome":"Sistemas de Gerenciamento de Bancos de Dados para a Plataforma Aberta","novo":{},"itens":[{"descricao":"Oracle 11g sobre Oracle Unbreakable Linux 64 bits","obrigatorio":false,"validacao":"Item 2.3"},{"descricao":"Microsoft SQL Server 2008;","obrigatorio":false,"validacao":"Item 2.3"},{"descricao":"MySQL 5.1 ou superior","obrigatorio":false,"validacao":"Em caso de software Livre"}]},{"nome":"Estações de Trabalho","novo":{},"itens":[{"descricao":"Compatível com o Microsoft Terminal Services Client (MSTSC)","obrigatorio":false,"validacao":"Caso a aplicação vá funcionar sobre TS.\nTestar acesso e conectividade com periféricos(mouse, teclado, impressora, leitoras, etc). Verificar memória utilizada e seu limite por servidor."}]},{"nome":"Requisitos Adicionais","novo":{},"itens":[{"descricao":"Todas as funcionalidades do software devem ser executadas via navegador web compatível com Internet Explorer 6.0 e superiores e/ou Mozilla Firefox 3.16 e superiores;","obrigatorio":true,"validacao":"Testar navegação(menus, links, impressão, etc)"},{"descricao":"Sistema deverá ter licença de uso para acesso ilimitado, tanto em quantidade de usuários quanto em conexões simultâneas;","obrigatorio":true,"validacao":"Ver com fornecedor local de configuração (se for o caso)"},{"descricao":"O sistema proposto não deverá necessitar de nenhum runtime, plugin ou componente pago separadamente;","obrigatorio":false,"validacao":"Em casos específicos poderá ser necessário plugins (avaliar) – Teste 6.1"},{"descricao":"A solução deve ser escalável. Possuir compatibilidade com mecanismos de balanceamento de carga e cluster;","obrigatorio":true,"validacao":"Verificar quantidade máxima estimada de usuários e instalar em n servidores/cluster/load balance e verificar resultados"},{"descricao":"A solução deverá ser compatível com a arquitetura 64 bits;","obrigatorio":true,"validacao":"1.1 e 1.2"},{"descricao":"Possuir manuais do usuário on-line, com possibilidade de impressão, e documentação técnica do software em idioma português do Brasil;","obrigatorio":true,"validacao":"Receber formalmente (com recibo) a documentação do usuário."},{"descricao":"Possuir interface gráfica em idioma português do Brasil para usuário final e para o usuário administrador;","obrigatorio":true,"validacao":"Logar como usuário e como administrador na aplicação"},{"descricao":"Permitir customizações, de forma a atender a especificidades do BRB;","obrigatorio":false,"validacao":"Verificar com o gestor tal necessidade"},{"descricao":"O fornecedor deverá comprovar que o sistema oferecido para o BRB já está implementado e em funcionamento em pelo menos uma empresa ou órgão;","obrigatorio":true,"validacao":"Copia de contrato / NF com a empresa. Validar"},{"descricao":"Possuir funções de segurança e auditoria, com registro das operações realizadas no sistema (LOG);","obrigatorio":true,"validacao":"Validar em relatórios, arquivos"},{"descricao":"Controle para níveis de acesso (perfis) por Grupos e por Usuários com base no Active Directory (AD) da Microsoft versão 2000 e superior, possibilitando limitações/permissões.","obrigatorio":true,"validacao":"Validar através de Login e opções de administração dos acessos da aplicação."}]}]